backend/controllers/ContentController.php

INSERT INTO `lulu_content` (`user_id`, `content_type`, `focus_count`, `favorite_count`, `view_count`, `comment_count`, `agree_count`, `against_count`, `is_sticky`, `is_recommend`, `is_headline`, `flag`, `allow_comment`, `sort_num`, `visibility`, `status`, `title`, `url_alias`, `summary`, `thumb`, `password`, `takonomy_id`, `template`, `created_at`, `updated_at`) VALUES (1, 'page', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 'dd', '', 'dd', '', '', NULL, '', 1431343419, 1431343419)
---
    public function saveContent($model, $bodyModel)
    {
        $postDatas = Yii::$app->request->post();

        if ($model->load($postDatas) && $bodyModel->load($postDatas) && $model->validate() && $bodyModel->validate()) {

            if($model->summary===null|| $model->summary ==='')
            {
                if($bodyModel->hasAttribute('body'))
                {
                    $content = strip_tags($bodyModel->body);
                    $pattern = '/\s/';//去除空白
                    $content = preg_replace($pattern, '', $content);

                    $model->summary=StringHelper::subStr($content,250);
                }
            }

            if($model->save())