source/modules/modularity/ModuleManager.php

    public function loadActiveModules($isAdmin=false)
    {
        $field = $isAdmin ? 'enable_admin' : 'enable_home';

        $allModules = Modularity::find()->where([
            $field => 1
        ])
            ->indexBy('id')
            ->all();
---
SELECT * FROM `lulu_modularity` WHERE `enable_admin`=1

    public function loadModules()
    {
        $ret = [];

        $allModules = Modularity::find()->indexBy('id')->all();
---
SELECT * FROM `lulu_modularity`