source/modules/modularity/admin/DefaultController.php

INSERT INTO `lulu_modularity` (`id`, `enable_admin`, `enable_home`) VALUES ('page', 0, 0)
---
    public function actionInstall($id)
    {
        $model = new Modularity();
        $model->id = $id;
        $model->enable_admin = 0;
        $model->enable_home = 0;
        $model->save();

UPDATE `lulu_modularity` SET `enable_admin`=1 WHERE `id`='page'
---
    public function actionActive($id, $is_admin = null)
    {
        $field = $is_admin === null ? 'enable_home' : 'enable_admin';
        Modularity::updateAll([$field => 1], ['id' => $id ]);