frontend/controllers/ContentController.php

	public function actionDetail($id)
	{
	    Content::updateAllCounters(['view_count'=>1],['id'=>$id]);
---
UPDATE `lulu_content` SET `view_count`=`view_count`+1 WHERE `id`='4'